# Напишите программу, которая будет преобразовывать
#  десятичное число в двоичное.

numbers = int(input('введите число = '))
print(f'двоичное число {numbers} = {bin(numbers)}')
